{
  "name" : "asian",
  "lite" : [
    {
      "name": "Sesame Green Beans",
      "prepTime": "10",
      "stars": "4.4",
      "ingredients": ["1 lb. green beans, trimmed", "1 tsp. salt", "1 tbsp. soy sauce or Braggs Liquid Aminos", "3 splashes of ginger juice OR 1/2 tsp. of freshly grated ginger root", "1/5 tbsp. butter, cubed", "1 1/2 tsp. toasted sesame seeds", "1 tbsp. rice wine vinegar"],
      "calories": "38",
      "recipe": ["Steam green beans for about 10 mins. When the beans are cooked through but still crisp, place in a serving bowl. Toss all other ingredients and serve", "Number of Servings: 4"],
      "imgLink": "https://c1.staticflickr.com/3/2618/3698269265_a6433ef9b1.jpg"
    },{
      "name": "Russian Olivier Salad",
      "prepTime": "80",
      "stars": "5",
      "ingredients": ["Eggs, hard boiled - 7", "Lean beef, cooked - 170 g", "Kentucky Legend Ham - 190g", "Canned peas - 1 can", "Nearly cooked potatoes, peeled - 4 medium or 308 g", "Nearly cooked carrots, peeled - 94 g", "Cucumber, peeled - 210g or 1 medium", "Cucumber pickles - 175 g", "Mayonnaise - 100 g", "Sour cream - 155 g"],
      "recipe": ["Cut everything to a size of peas, mix with mayo and sour cream", "Number of Servings: 20"],
      "calories": "145",
      "imgLink": "https://cdn.pixabay.com/photo/2017/05/13/18/16/russian-salad-2310348_960_720.jpg"
    },{
      "name": "Thai Mango Salad",
      "prepTime": "20",
      "stars": "4.5",
      "ingredients": ["2 firm mangos, grated (julienned is better)", "0.5 cup bean sprouts", "1 green onion, diced", "1/4 red pepper, thinly sliced", "0.25 cup snow peas", "2 tbsp chopped fresh cilantro", "1 lime, squeezed", "1 tbsp fish sauce (omit for vegetarian)", "0.5 tbsp cashew nuts", "Chili flakes"],
      "recipe": ["Grate the mangos. Add the diced onion, bean sprouts, red pepper, snow peas and cilantro. Add fish sauce and squeezed juice of lime. Sprinkle with chili flakes to make it spicy. Toss. Top with cashews. This should make 4 servings of approximately 1 cup", "Number of Servings: 4"],
      "calories": "98",
      "imgLink": "https://c1.staticflickr.com/9/8213/28806942311_55f17c26fe_b.jpg"
    }],
  "main" : [
    {
      "name": "Sesame Chicken",
      "prepTime": "140",
      "stars": "4",
      "ingredients": ["1 pound (16 ounces) boneless skinless chicken breast, cut into bite sized chunks", "3 Tbsp soy sauce", "3 Tbsp olive oil", "2 Tbsp raw cane sugar", "1 tsp honey", "1/2 tsp garlic powder", "1/4 cup white, untoasted sesame seeds", "liberal pinches of black pepper, ground ginger and ground cinnamon"],
      "recipe": ["Combine all ingredients except chicken in a bowl", "Add chicken, mix together well so the chicken is thoroughly coated in the marinade, cover and let it sit in the fridge for 2 hours or so", "Preheat oven to 350 degrees", "Arrange chicken on a cookie sheet, and pour liquid on top of it", "Bake in oven for 5 minutes, flip chicken pieces with a spatula, and bake for another 5 minutes, or until done", "Serve with brown rice (not included in the Nutritional Info, because everybody", "likes different amounts of rice, or some might even not want rice at all.)", "Makes 4 4-oz servings" ],
      "calories": "300",
      "imgLink": "https://cdn.pixabay.com/photo/2017/06/26/13/58/chicken-2443901_960_720.jpg"
    },{
      "name": "Shrimp Pad Thai",
      "prepTime": "30",
      "stars": "4.5",
      "ingredients": ["8 oz rice sticks", "2 T fish sauce", "2 T low-sodium soy sauce", "2 T brown sugar", "1/4 t crushed red pepper, or more to taste", "2 t vegetable oil", "1 egg, lightly beaten", "1 lb frozen shrimp", "4 garlic cloves, minced", "4 green onions, coarsely onions", "2 C fresh bean sprouts", "2 T chopped peanuts", "lime wedges", "fresh chopped cilantro"],
      "recipe": ["Bring large pot pf water to boil. Remove from heat and add rice, stirring to separate. Soak 5-7 minutes, or until tender; then drain and rinse in cold water. Set aside.", "Mix fish sauce, soy sauce, sugar and crushed red pepper in small bowl until sugar dissolves. Set aside", "Heat 1 tsp oil in wok over med-high heat. Add egg, and cook quickly, until opaque. Move to side. Add frozen shrimp to wok, cook 5-7 minutes until just cooked through. Drain excess liquid. Add garlic, stir fry 1 minute.", "Add remaining oil, and then noodles. stir fry quickly until softened, about 2 minutes. Add sauce mixture. Coat noodles evenly, stirring until heated through. Stir in green onions, and bean sprouts and cook 2 more minutes. Mound on serving platter, and garnish with peanuts, lime wedges and cilantro", "Of course, you could substitute the shrimp with chicken, if you're family prefers. :) It's yummy either way", "Makes about 6 - 1 1/3 cup servings"],
      "calories": "211",
      "imgLink": "https://c1.staticflickr.com/5/4050/4339908741_da16cb10c7_b.jpg"
    },{
      "name": "Baked Chicken Egg Rolls",
      "prepTime": "55",
      "stars": "4.4",
      "ingredients": ["3 C bagged coleslaw mix, divided", "1/4 C sliced water chestnuts (about 10 slices)", "1/4 C green onions", "2 tea canola oil", "1 T minced ginger", "4 cloves garlic, minced", "1/4 C grated onion", "1lb ground chicken (boneless, skinless chicken breast, ground)", "1/4 t kosher salt", "2 tea low sodium soy sauce"],
      "recipe": ["Preheat oven to 425 Degrees. Spray a baking sheet with non-stick cooking spray. Set aside","In a food processor, combine 1 C of the bagged coleslaw, water chestnuts, and green onions. Pulse about 12 times or until ground into small pieces. Set aside","Mince garlic cloves and ginger. Grate onion until you have 1/4 C","In an extra large skillet on the stove top heat canola oil. Leave temperature at medium-high. Add the minced ginger, minced garlic, and grated onion. Saute for 2-3 minutes or until tender. Add the ground chicken and kosher salt. Cook until chicken is no longer pink","Add cabbage mixture to skillet along with the 2 C additional coleslaw mix. Saute for 2 minutes and then add soy sauce. Cook one minute longer and then remove from heat","Place 3-4 T filling in each egg roll wrapper and roll to seal","Place on baking sheet and spray the tops lightly with cooking spray","Bake in preheated oven for 20-25 minutes or until browned on the edges. (If under-baked, egg rolls will be chewy!) Let cool for 5-10 minutes before serving. ","Makes 14-16 egg rolls"],
      "calories": "234",
      "imgLink": "https://c1.staticflickr.com/2/1079/1025232597_acdf5fe191.jpg"
    },{
      "name": "Russian Meatless Borsht",
      "prepTime": "60",
      "stars": "4.5",
      "ingredients": ["1 pound beets (beetroot), peeled and cut into matchsticks", "2 medium onions, sliced into half-moons", "2 large carrots, peeled and cut into matchsticks", "3/4 pound white cabbage, cut thinly into shreds", "2 tablespoons olive oil", "5 cups vegetable stock", "Juice of 1/2 a lemon", "Salt to taste", "Coarsely ground black pepper", "Sour cream (optional, omit for vegan soup)", "Finely chopped parsley or chives (optional, for garnish)"],
      "recipe": ["Peel and cut the onions, carrots, and beets (alternatively, shred the carrots and beets using the shredding blade of a food processor) and sauté over medium heat in the olive oil with a pinch of salt in a large soup pot. Reserve a small amount of beet to grate and add near the end to enliven the color." ,"In the meantime, bring the vegetable stock to a boil. When the vegetables are soft (about 5 minutes), add the shredded cabbage and the hot stock. Bring to a boil and simmer 15-25 minutes, until the vegetables are tender. With a few minutes left, add the reserved grated beet.", "Season to taste with salt and pepper, then squeeze in the lemon juice, aiming for a pleasing but subtle sour taste. Serve with freshly grated black pepper, a dollop of sour cream, and chopped parsley, if desired.", "Number of Servings: 6"],
      "calories": "209",
      "imgLink": "https://upload.wikimedia.org/wikipedia/commons/3/38/Russian_borscht_with_beef_and_sour_cream.jpg"
    },{
      "name": "Russian mushroom and potato soup",
      "prepTime": "30",
      "stars": "5",
      "ingredients": ["5 tbsp butter divided", "3 leeks chopped", "6 large carrots sliced", "6 cups chicken broth", "1 tbsp dill weed", "1/2 tsp black pepper", "1 bay leaf", "2 lbs potatoes, semi peeled and sliced", "16 oz fresh mushrooms, cleaned and sliced", "1 cup milk", "1/4 cup flour"],
      "recipe": ["melt 3 tbsp butter; add the leeks and carrots.  saute 5 min.  stir in chicken broth, dill, slat, pepper adn bay leaf.  Add potatoes and simmer 20 min.  until potatoes are tender.  Remove bay leaf.  saute mushrooms in 2 tbsp butter 5 min.  combine mild and the flour.  sitr into soup with the mushrooms.  cook and stir until lightly thickened.  Is delicious with a slice of bread or a salad", "Number of Servings: 8"],
      "calories": "254",
      "imgLink": "https://upload.wikimedia.org/wikipedia/commons/2/2a/POL_Mushroom_and_Potato_Soup%2C_02.JPG"
    }],
  "sweet": [{
    "name": "Russian Teacakes",
    "prepTime": "20",
    "stars": "4",
    "ingredients": ["2 1/2 cups flour", "1 tsp vanilla", "1 cup soft butter", "1/2 cup sifted powdered sugar", "1 tsp salt", "1/2 cup finely chopped nuts (walnuts or pecans)"],
    "recipe": ["Mix all ingredients", "Roll into small balls and put on ungreased cookie sheet. Bake at 355 degrees for 15 minutes","When cool, roll in powdered sugar. (or roll inpowdered sugar while still warm and then again when cooled.)"],
    "calories": "81",
    "imgLink": "https://c1.staticflickr.com/9/8357/8307560889_401be2980b_b.jpg"
  },{
    "name": "Blueberry Cobbler",
    "prepTime": "30",
    "stars": "4.5",
    "ingredients": [
      "2 teaspoons sugar",
      "3/4 cup fresh or frozen blueberries",
      "1 tablespoon unsweetened shredded coconut",
      "1 1/2 tablespoons almond meal or all-purpose flour",
      "1 teaspoon unsweetened applesauce",
      "1 pinch salt",
      "1 splash vanilla extract",
      "Sweetener to taste"
    ],
    "recipe": [
      "Preheat oven to 400 degrees. In a small skillet, melt sugar over medium-low heat. When completely dissolved (about 1 minute), add blueberries and cook, stirring frequently, for 3 to 4 minutes or until berries are liquidy but still retain some of their shape. Remove from heat",
      "Meanwhile, combine coconut, almond meal, applesauce, salt, vanilla extract, and sweetener in a small bowl and mix well. Applesauce should coat other ingredients so they stick together but aren’t too moist. Place blueberry mixture in a greased 6- to 8-ounce ramekin and sprinkle coconut mixture in small bits over top. Bake for about 20 minutes or until top is cooked, crisp, and slightly browned. Let cool"
    ],
    "calories": "168",
    "imgLink": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTvU7qOY1SXagQvwo4GTexqqt2e_IIA93iKYvvuJ3TYmxihdN9l"
  },{
    "name": "Chinese Coconut Pudding",
    "prepTime": "65",
    "stars": "4.5",
    "ingredients": [
      "2 tbsp unflavored gelatin",
      "1 3/8 cups water (1/2 cup cold, rest boiling)",
      "1 can of coconut milk (400 ml)",
      "1/2 cup sugar",
      "2 egg whites"
      ],
    "recipe": [
      "Lightly grease a 1 litre container if you are going to flip out the pudding before serving. Otherwise, use a container which you can cut the pudding in without scratching the container",
      "In a small microwaveable bowl, dissolve gelatin with 1/2 cup of cold water. Set aside for 5 mins",
      "Microwave the gelatin mixture for 10-15 seconds",
      "Transfer to larger bowl, pour remaining boiling water to mix well. (Step 2 is to avoid having lumps in gelatin mixture)",
      "Add sugar, once it is dissolved, add coconut milk. Allow to cool to room temperature",
      "Whip egg whites until soft peak",
      "When gelatin is cooled to room temperature, place gelatin bowl in an ice bath",
      "When mixture begins to set*, fold egg whites into it",
      "Spread in prepared dish and refrigerate until set",
      "Equally divide into 4 before serving"
    ],
    "calories": "174",
    "imgLink": "http://www.flickr.com/photos/benhosg/40338474261/in/pool-72296557@N00"
  }],
}
