{
  "region" : "Indian",
  "light-dishes" : [
    {
      "name" : "Indian Lentils and Spinach" ,
      "prep-time" : "1hr 15min" ,
      "stars" : "4.5" ,
      "ingredients" : ["1 tablespoon vegetable oil","1 white onion, halved and sliced into 1/2-inch rings","3 cloves garlic, minced","2 cups chicken broth", "1 cup lentils","1/2 cup water", "2 cloves garlic, crushed","1 1/2 teaspoons ground coriander","1 teaspoon salt", "1 teaspoon ground cumin", "1 teaspoon chili powder","1/2 teaspoon ground ginger", "1/4 teaspoon ground cinnamon","1/4 teaspoon ground turmeric","1/4 teaspoon ground cinnamon", "1/4 teaspoon ground cloves", "1/8 teaspoon cayenne pepper", "1 bay leaf", "1 (10 ounce) package frozen chopped spinach", "1/4 cup water"] ,
      "recipe" : ["Heat oil in a heavy pan over medium heat. Cook and stir onion in the hot oil until beginning to turn golden brown, about 10 minutes. Add minced garlic to onion; cook and stir until fragrant, about 1 minute more.",
        "Mix chicken broth, lentils, 1/2 cup water, crushed garlic, coriander, salt, cumin, chili powder, ginger, cinnamon, turmeric, cinnamon, cloves, cayenne pepper, and bay leaf into onion mixture; bring to a boil. Cover pan, lower heat to medium-low, and simmer until lentils are soft, about 35 minutes.",
        "Place spinach in a microwave-safe bowl and add 1/4 cup water; heat in microwave for 5 minutes. Stir spinach and continue cooking in microwave until heated through, about 5 minutes more. Let spinach cool, about 5 minutes; drain water and squeeze excess water from spinach.",
      "Mix spinach into lentils; cover pan and simmer until heated through, about 10 minutes."] ,
      "calories" : "129" ,
      "img-link" : "https://images.media-allrecipes.com/userphotos/560x315/4489011.jpg"
    },
    {
      "name" : "Indian Corn Pakoda",
      "prep-time" : "19 min",
      "stars" : "5",
      "ingredients" : ["1 1/2 cups frozen sweet corn, rinsed and well drained", "2 green chile peppers, chopped", "1 small onion, thinly sliced", "2 tablespoons rice flour, or more as needed", "2 tablespoons besan (chickpea flour), or more to taste", "1 sprig curry leaves", "1 teaspoon ginger garlic paste", "1/2 teaspoon garam masala", "1/2 teaspoon ground red chile pepper", "1/2 teaspoon ground cumin", "1 pinch ground turmeric", "salt to taste", "vegetable oil for frying"],
      "recipe" : ["Pour sweet corn into a food processor; pulse until coarsely chopped. Mix in chile peppers, onion, rice flour, besan, curry leaves, ginger garlic paste, garam masala, red chile pepper, cumin, turmeric, and salt.","Heat oil in a deep-fryer or large saucepan. Drop small scoops of the corn mixture into the hot oil; cook until golden brown, about 2 minutes per side. Drain on paper towels."],
      "calories" : "137" ,
      "img-link" : "https://images.media-allrecipes.com/userphotos/560x315/4488080.jpg"
    },
    {
      "name": "Indian Sweet Bread",
      "prep-time" : "40 min",
      "stars" : "4",
      "ingredients" : ["2 cups all-purpose flour", "1/4 teaspoon salt", "2/3 cup water", "1/4 cup white sugar", "1 tablespoon vegetable oil"],
      "recipe" : ["In a large bowl, stir together flour, salt and water until a soft dough is formed. Turn dough out onto a lightly floured surface and knead briefly. Divide dough into golf ball size pieces and cover with a damp cloth or plastic wrap." , "Select a ball of dough and roll out until very thin but not torn. Sprinkle lightly and evenly with sugar. Fold up dough into a small square and roll out again until thin." ,"Heat a lightly oiled griddle over medium heat. Place the rolled dough onto the pan and cook for 1/2 to 1 minute on each side until golden. Serve immediately. Repeat until all dough balls have been rolled and cooked."],
      "calories" : "102",
      "img-link" : "https://images.media-allrecipes.com/userphotos/250x250/117154.jpg"
    },
    {
      "name" : "Indian Tomato Chicken",
      "prep-time" : "1hr 34min" ,
      "stars" : "4.5",
      "ingredients" : ["1 large onion, chopped", "4 cloves garlic, chopped", "1 slice fresh ginger root", "1 tablespoon olive oil", "2 teaspoons ground cumin", "1 teaspoon ground turmeric", "1 teaspoon salt", "1 teaspoon ground black pepper", "1/2 teaspoon ground cardamom", "1 (1 inch) piece cinnamon stick", "1/4 teaspoon ground cloves", "2 bay leaves", "1/4 teaspoon ground nutmeg", "6 skinless chicken thighs", "1 (14.5 ounce) can whole peeled tomatoes, crushed "],
      "recipe" : ["Place onion, garlic and ginger in a food processor and process into a paste. Heat oil in a large skillet over medium heat, add onion paste and saute, stirring continuously, for about 10 minutes.", "Stir in the cumin, turmeric, salt, pepper, cardamom, cinnamon, cloves, bay leaves and nutmeg. Saute, stirring, for 1 to 2 minutes. Place chicken pieces in skillet and stir them around with the spice mixture until they are well coated.", "Saute for another 4 minutes, then pour in the tomatoes with liquid and stir. Reduce heat to low and simmer for 1 to 2 hours, or until the oil has separated from the liquid. Stir occasionally. (Note: If you simmer uncovered, the sauce will thicken; add water, or keep covered while simmering.)"],
      "calories": "134",
      "img-link": "https://images.media-allrecipes.com/userphotos/560x315/1108395.jpg"
    },
    {
      "name" : "Indian Chai Hot Chocolate",
      "prep-time": "5 min",
      "stars": "4.5",
      "ingredients" : ["1/2 cup water", "1/2 cup milk", "1 chai tea bag", "1 (.55 ounce) package instant hot chocolate mix"],
      "recipe" : ["Stir the water and milk together in a microwave-safe mug.", "Cook on high in the microwave for 1 1/2 minutes.", "Remove, and add the chai teabag.", "Allow tea to steep about 2 minutes. Remove the tea bag, and stir in the hot chocolate mix."],
      "calories" : "126" ,
      "img-link" : "https://images.media-allrecipes.com/userphotos/560x315/765567.jpg"
    },
    {
      "name" : "Indian Relish",
      "prep-time" : "4hr 35min",
      "stars": "4.5",
      "ingredients": ["2 red bell peppers, chopped", "1 sweet onion, peeled and chopped", "1 cup white wine vinegar", "1 cup white sugar", "1 tablespoon crushed red pepper flakes"],
      "recipe" : ["In a medium saucepan over medium heat, mix together red bell peppers, onion, white wine vinegar, sugar and crushed red pepper flakes. Bring to a boil, then reduce heat to simmer. Stirring occasionally, cook 30 minutes, or until thickened. Refrigerate 4 hours or overnight before serving."],
      "calories": "38",
      "img-link": "https://images.media-allrecipes.com/userphotos/250x250/86389.jpg"
    }
  ],
  "main-course"   :  [
    {
      "name" : "Aloo Gobhi",
      "prep-time" : "44 min",
      "stars": "4",
      "ingredients" : [
        "2 tablespoons vegetable oil",
        "1 large onion, sliced thin",
        "4 cloves garlic, minced",
        "1 tablespoon minced fresh ginger root",
        "10 sprigs fresh cilantro, stems and leaves separated and minced",
        "2 green chile peppers, sliced into thin rings",
        "1/2 teaspoon ground turmeric",
        "1 tomato, chopped",
        "2 potatoes, peeled, halved, and sliced",
        "1 large head cauliflower, cut into small florets",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "1/2 teaspoon garam masala",
        "1/2 teaspoon ground red pepper",
        "1/2 teaspoon white sugar",
        "salt to taste",
        "1/2 cup water",
        "2 tablespoons tomato puree"
      ],
      "recipe": [
        "Heat the oil in a large skillet over medium heat.",
        "Cook and stir the onion, garlic, and ginger in the hot oil until golden brown, about 5 minutes.",
        "Stir the cilantro stems, green chiles, and turmeric into the mixture.",
        "Mix the tomato into the mixture and continue cooking until the tomatoes are softened.",
        "Add the potatoes; cook and stir until the potatoes are completely coated in the mixture.",
        "Fold the cauliflower florets into the mixture; season with the cumin, coriander, garam masala, ground red pepper, sugar, and salt.",
        "Pour the water over the mixture and stir until evenly mixed.",
        "Bring the mixture to a boil; cover, reduce heat to medium-low, and cook until the potatoes and cauliflower are tender but not mushy, about 20 minutes.",
        "Taste for desired seasoning. If you feel the sabji is not tart enough, add the tomato puree.",
        "Garnish with the cilantro leaves to serve."
      ],
      "calories" : "244",
      "img-link" : "https://images.media-allrecipes.com/userphotos/560x315/4005069.jpg"},
    {
      "name": "Indian Chickpeas",
      "prep-time" : "45 min",
      "stars" :"4.5",
      "ingredients" : ["2 tablespoons vegetable oil",
        "4 cloves garlic, minced",
        "1/2 cup onion, chopped",
        "1 tablespoon minced fresh ginger root",
        "1/8 teaspoon garam masala",
        "2 teaspoons channa masala spice mix",
        "1 large tomato, chopped",
        "1 1/2 cups water",
        "2 (15.5 ounce) cans garbanzo beans, drained and rinsed",
        "salt to taste"],
      "recipe" : ["Heat oil in a saucepan over medium-high heat.",
        "Stir in the garlic, onion, and ginger, and cook until browned.",
        "Stir in the garam masala, channa masala spice, tomato, water, and garbanzos; season to taste with salt.",
        "Bring to a simmer, the reduce heat to low, cover and simmer until garbanzos are very soft, about 20 minutes."],
      "calories" : "232" ,
      "img-link": "https://images.media-allrecipes.com/userphotos/560x315/5116299.jpg"
    },
    {
      "name" : "Dal Makhani (Butter Lentils)",
      "prep-time" : "2h 15 min",
      "stars": "4",
      "ingredients" : ["1 1/2 cups lentils",
        "2 tablespoons ground cinnamon",
        "1 tablespoon chile powder",
        "1 tablespoon ground coriander",
        "1 tablespoon ground cumin",
        "1 tablespoon ground turmeric",
        "1 teaspoon nutmeg",
        "1 teaspoon paprika",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground cayenne pepper",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground allspice",
        "2 bay leaves",
        "2 tablespoons olive oil",
        "5 tomatoes, pureed",
        "2 tablespoons ginger paste",
        "3 cloves garlic, minced",
        "2 tablespoons white sugar",
        "salt to taste",
        "1 cup heavy whipping cream",
        "6 tablespoons butter",
        "1 lime, cut into wedges"],
      "recipe":["Soak lentils in a saucepan of water for 1 hour. Bring to a boil for 5 minutes. Drain.",
        "Heat cinnamon, chile powder, coriander, cumin, turmeric, nutmeg, paprika, black pepper, cayenne, cloves, allspice, and bay leaves in a large skillet over medium heat, stirring occasionally, until fragrant, about 5 minutes.",
        "Stir olive oil into the skillet.",
        "Add tomatoes, ginger paste, and garlic; simmer until flavors combine, about 10 minutes.",
        "Stir in sugar and salt. Cook until mixture thickens into a pulpy sauce, about 5 minutes.",
        "Add lentils and simmer until tender, about 5 minutes.",
        "Stir cream and butter into sauce.",
        "Cook until sauce thickens and lentils are very soft, about 30 minutes.",
        "Squeeze some lime juice over each serving."],
      "calories" : "540",
      "img-link" : "https://images.media-allrecipes.com/userphotos/560x315/4401972.jpg"
    },
    {
      "name" : "Shahi Paneer",
      "prep-time": "35 min",
      "stars" : "4.5",
      "ingredients" : ["2 tablespoons cooking oil",
        "1 large onion, thinly sliced",
        "4 cloves garlic, minced",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon Kashmiri red chili powder",
        "4 tomatoes, pureed",
        "1/2 pound paneer, cubed",
        "1/4 cup water",
        "1 teaspoon white sugar",
        "salt to taste",
        "1/4 cup cream",
        "2 tablespoons chopped fresh cilantro"],
      "recipe" : ["Heat the oil in a large skillet over medium heat.",
        "Cook the onion and garlic in the hot oil until the onions are soft and golden brown, about 5 minutes.",
        "Sprinkle the cumin, coriander, turmeric, and chili powder over the onion and garlic; continue cooking until the seasonings are fragrant, about 30 seconds.",
        "Pour the pureed tomatoes into the skillet; cook until the excess liquid evaporates and the oil separates, 3 to 5 minutes.",
        "Add the paneer, water, sugar, and salt to the mixture; stir gently so the paneer does not break apart.",
        "Cook until the paneer begins to absorb some of the liquid, about 10 minutes.",
        "Stir the cream into the mixture and simmer another 5 minutes.",
        "Garnish with cilantro to serve."],
      "calories" : "227",
      "img-link" : "https://images.media-allrecipes.com/userphotos/560x315/4484971.jpg"},
    {
      "name" : "Vegetable Biryani (Tehri)",
      "prep-time" : "51min",
      "stars" : "4",
      "ingredients" : ["2 cups long-grain white rice",
        "3 tablespoons vegetable oil",
        "1 large onion, thinly sliced",
        "1/2 teaspoon cumin seeds",
        "2 bay leaves, broken in half",
        "2 potatoes, quartered",
        "2 carrots, quartered",
        "1 1/2 teaspoons ground turmeric",
        "1 teaspoon chile powder, or more to taste",
        "1/2 teaspoon ground coriander",
        "2 1/2 cups water",
        "1 cup shelled peas",
        "1 1/2 teaspoons salt, or to taste",
        "1 teaspoon butter",
        "1/2 teaspoon garam masala"],
      "recipe" : ["Place rice in large container and cover with several inches of cool water; let soak for 20 minutes. Drain.",
        "Heat oil in a pressure cooker over medium heat.",
        "Add onion, cumin seeds, and bay leaves; cook and stir until onion is translucent, about 5 minutes.",
        "Stir in potatoes and carrots; cook until lightly browned, about 5 minutes.",
        "Stir in turmeric, chile powder, and coriander; cook until fragrant, about 1 minute.",
        "Stir rice gently into the pressure cooker until evenly coated with oil.",
        "Pour in water and peas. Stir in salt, butter, and garam masala.",
        "Seal cooker and bring to high pressure according to manufacturer's instructions.",
        "Cook for 5 minutes. Remove from heat.",
       " Release pressure naturally according to manufacturer's instructions.",
        "Fluff rice with a fork."],
      "calories" : "392",
      "img-link" : "https://images.media-allrecipes.com/userphotos/560x315/4433065.jpg"},
    {
      "name": "Palak Paneer",
      "prep-time": "1 hr 25min",
      "stars": "4.5",
      "ingredients": ["1 gallon whole milk",
        "1/2 cup lemon juice",
        "1 bunch fresh spinach leaves",
        "1 pound tomatoes",
        "1/4 cup ghee (clarified butter)",
        "1 teaspoon turmeric powder",
        "1 teaspoon ground red chile pepper",
        "1/4 teaspoon asafoetida powder (hing)",
        "1 1/2 teaspoons salt, or to taste",
        "2 tablespoons heavy whipping cream, or more as needed",
        "1/4 teaspoon ground fenugreek seeds (methi powder)"],
      "recipe": ["Line a colander with a cheesecloth and place in the sink.",
        "Bring milk to a boil in a large pot; add lemon juice. Stir until milk separates into curds and whey. Transfer curds with a large slotted spoon to the prepared colander and allow curds to drain. Whey can be saved for another use.",
        "Bring a large pot of water to a boil; add spinach. Simmer until spinach is wilted, 1 to 2 minutes. Transfer spinach to a bowl with a slotted spoon. Drop tomatoes into the same pot of boiling water; simmer until tomato skins begin to split, 3 to 5 minutes. Drain. Peel tomato skins when cool enough to handle.",
        "Place spinach in a blender or food processor; puree until smooth and remove spinach to a bowl.",
        "Place peeled tomatoes in a blender or food processor; puree until smooth and remove tomatoes to another bowl.",
        "Unwrap curd ball from cheesecloth; paneer should now be a solid block. Cut paneer into small cubes.",
        "Heat ghee in a large skillet over medium-low heat; cook and stir turmeric, ground red chile powder, and asafoetida powder in hot ghee until fragrant, about 20 seconds. Stir in tomato puree into ghee and spices and increase heat to medium. Cover and simmer until ghee rises to the top, about 10 minutes.",
        "Stir spinach puree and salt into tomato mixture. Continue to simmer until fragrant, 5 to 10 minutes more. Add cubed paneer to skillet; cook until paneer is softened, 2 to 3 minutes. Stir cream into spinach-tomato mixture, cover, and simmer until hot, 2 to 3 minutes more.",
        "Remove skillet from heat and sprinkle with ground fenugreek. Cool for a few minutes before serving."],
      "calories": "517",
      "img-link": "https://images.media-allrecipes.com/userphotos/560x315/1005321.jpg"},
    {
      "name": "Indian Vegetable Bhaji",
      "prep-time" : "55 min",
      "stars": "4",
      "ingredients" : ["4 large potatoes, finely chopped",
        "1 cup cauliflower florets",
        "1 carrot, finely chopped",
        "1/2 cup fresh green peas",
        "2 tablespoons vegetable oil",
        "1 large onion, chopped",
        "1 teaspoon cumin seed",
        "1 teaspoon black mustard seed",
        "2 whole bay leaves",
        "4 green chile peppers, chopped",
        "3 cloves garlic, chopped",
        "2 teaspoons minced fresh ginger root",
        "1 teaspoon ground cumin",
        "1 teaspoon curry powder",
        "1/2 teaspoon chili powder (optional)",
        "cilantro leaves for garnish (optional)"],
      "recipe" : ["Place the potatoes, cauliflower florets, carrot, and peas into a microwave-safe bowl, cover with plastic wrap, and microwave on High until the vegetables are very hot and starting to soften, about 2 minutes. Remove the plastic wrap, and drain the vegetables in a colander.",
        "Place the vegetable oil in a large skillet, and heat over medium heat. Cook and stir the onion until it turns golden, about 10 minutes, and stir in the cumin seed, black mustard seed, and bay leaves. Cook and stir until the seeds begin to sputter, about 30 seconds, and then add the green chiles, garlic, and ginger. Cook and stir until the garlic begins to brown, about 1 minute.",
        "Stir in the ground cumin, curry powder, and chili powder, and then add the partially cooked potatoes, cauliflower, carrot, and peas. Cook and stir until the vegetables are tender and coated with spices, about 30 minutes. Sprinkle with cilantro leaves."
      ],
      "calories" : "279",
      "img-link" : "https://images.media-allrecipes.com/userphotos/250x250/851956.jpg"
    }

  ],
  "desserts" : [
    {
      "name" : "Gulab Jamun",
      "prep-time" : "50 min",
      "stars" : "4",
      "ingredients" : ["1 cup dry milk powder",
        "3 tablespoons all-purpose flour",
        "2 tablespoons ghee (clarified butter), melted",
        "1/2 teaspoon baking powder",
        "1/2 cup warm milk",
        "1 tablespoon chopped almonds (optional)",
        "1 tablespoon chopped pistachio nuts (optional)",
        "1 tablespoon golden raisins (optional)",
        "1 pinch ground cardamom",
        "1 quart vegetable oil for deep frying",
        "1 1/4 cups white sugar",
        "7 fluid ounces water",
        "1 pinch ground cardamom "],
      "recipe" : ["In a large bowl, stir together the milk powder, flour, baking powder, and cardamom. Stir in the almonds, pistachios and golden raisins. Mix in the melted ghee, then pour in the milk, and continue to mix until well blended. Cover and let rest for 20 minutes.",
        "In a large skillet, stir together the sugar, water, rose water and a pinch of cardamom. Bring to a boil, and simmer for just a minute. Set aside.",
        "Fill a large heavy skillet halfway with oil. Heat over medium heat for at least 5 minutes. Knead the dough, and form into about 20 small balls. Reduce the heat of the oil to low, and fry the balls in one or two batches. After about 5 minutes, they will start to float, and expand to twice their original size, but the color will not change much. After the jamun float, increase the heat to medium, and turn them frequently until light golden. Remove from the oil to paper towels using a slotted spoon, and allow to cool. Drain on paper towels and allow to cool slightly.",
        "Place the balls into the skillet with the syrup. Simmer over medium heat for about 5 minutes, squeezing them gently to soak up the syrup. Serve immediately, or chill."],
      "calories" : "143",
      "img-link" : "https://images.media-allrecipes.com/userphotos/250x250/334409.jpg"
    },

    {
      "name" : "Kulfi",
      "prep-time" : "8hr 20min",
      "stars" : "4.5" ,
      "ingredients" : ["1 1/4 cups evaporated milk",
        "1 1/4 cups sweetened condensed milk",
        "1 (16 ounce) container frozen whipped topping, thawed",
        "4 slices white bread, torn into pieces",
        "1/2 teaspoon ground cardamom"],
      "recipe" : ["Combine evaporated milk, condensed milk and whipped topping in a blender and blend in pieces of bread until smooth.",
        "Pour mixture into a 9x13 inch baking dish or two plastic ice cube trays, sprinkle with cardamom and freeze for 8 hours or overnight."],
      "calories" : "139",
      "img-link" : "https://images.media-allrecipes.com/userphotos/560x315/736349.jpg"
    },

    {
      "name" : "Besan (Gram Flour) Halwa",
      "prep-time" : "35min",
      "stars" : "4.5" ,
      "ingredients" : ["1 cup milk",
        "1/2 cup water",
        "1/2 teaspoon ground cardamom",
        "3/4 cup ghee (clarified butter)",
        "1 cup chickpea flour (besan)",
        "1 cup sugar"],
      "recipe" : ["Bring the milk and water to a simmer in a saucepan over medium-low heat; stir the cardamom into the mixture. Set aside.",
        "Melt the ghee in a shallow skillet over medium heat; stir the chickpea flour into the melted ghee and cook until fragrant, about 10 minutes. Add the sugar and stir to incorporate. Slowly pour the milk mixture into the skillet while stirring to avoid lumps. Continue cooking and stirring until the halwa pulls away from the sides of the pan, 10 to 15 minutes. Serve hot or spread the mixture into a rimmed plate and allow to cool. Cut into squares and serve."],
      "calories" : "323",
      "img-link" : "https://images.media-allrecipes.com/userphotos/560x315/3934184.jpg"
    },
    {
      "name" : "Shahi Tukra (Indian Bread Pudding)",
      "prep-time" : "2hr 55min",
      "stars" : "4" ,
      "ingredients" : ["1 quart oil for deep frying",
        "8 slices white bread, crusts removed and cut into 4 squares",
        "1/4 cup cashews",
        "1/4 cup sliced almonds",
        "2 tablespoons pistachio nuts",
        "1 1/4 cups whole milk",
        "5 tablespoons evaporated milk",
        "3/4 cup white sugar",
        "1 teaspoon ground cardamom",
        "1 pinch saffron"],
      "recipe" : ["Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Fry the bread slices in the hot oil until deep, golden brown; drain on a plate lined with paper towels. Fry the cashews, almonds, and pistachio nuts in the hot oil until golden brown; remove from oil and set aside to cool. Chop roughly.",
        "Bring the milk to a gentle boil in a heavy-bottomed pan over medium-low heat; continue boiling until the volume of milk reduces by about half. Pour the evaporated milk into the pan and add the sugar, cardamom, and saffron; simmer together 5 to 10 minutes. Remove from heat and allow to cool completely.",
        "Arrange the fried bread pieces in a shallow dish large enough to allow them to be laid in a single layer. Evenly pour the milk mixture over the bread. Scatter the chopped nuts over the bread. Chill in refrigerator until completely cold, 1 to 2 hours."],
      "calories" : "324",
      "img-link" : "https://images.media-allrecipes.com/userphotos/560x315/2311160.jpg"
    },
    {
      "name" : "Rasgullas",
      "prep-time" : "1hr 50min",
      "stars" : "5" ,
      "ingredients" : ["6 cups milk ",
        "3 tablespoons fresh lime juice",
        "2 1/2 cups white sugar",
        "6 cups water",
        "1 teaspoon ground cardamom"],
      "recipe" : ["Bring the milk to a boil in a heavy-bottomed pan till it starts foaming; immediately add the lime juice and stir. It will curdle right away. You should see the milk solids (chenna) separate from the whey. Pour into a colander lined with cheesecloth; rinse the chenna with cold water to get rid of the lime juice. Allow the water to drain completely.",
        "Gather the muslin cloth edges like a parcel and express as much water as possible; what you now have is soft paneer. Turn the paneer onto a rolling mat or other smooth surface. Knead the paneer well to make a smooth paste. Roll into a ball and divide into 20 equal portions.",
        "Bring the water to a boil in a pressure cooker; stir the sugar into the boiling water until dissolved.",
        "Roll each portion of paneer into a smooth ball between your palms, making sure there are no cracks; gently drop the balls into the hot syrup. Secure the lid onto the pressure cooker and bring to pressure. Reduce heat to medium-low and pressure cook for 6 minutes.",
        "Release the pressure from the cooker while running under water; remove the lid. The rasgullas should be floating on the syrup and have expanded 2 or 3 times in size. Pour the rasgullas and syrup into a bowl. Gently stir the cardamom into the mixture. Refrigerate to chill completely before serving cold."],
      "calories" : "134",
      "img-link" : "https://images.media-allrecipes.com/userphotos/250x250/564413.jpg"
    }
  ]


}
